/*---------------------------------------------------------------------*/
/* --- STC MCU Limited ------------------------------------------------*/
/* --- STC 1T Series MCU Demo Programme -------------------------------*/
/* --- Mobile: (86)13922805190 ----------------------------------------*/
/* --- Fax: 86-0513-55012956,55012947,55012969 ------------------------*/
/* --- Tel: 86-0513-55012928,55012929,55012966 ------------------------*/
/* --- Web: www.STCAI.com ---------------------------------------------*/
/* --- Web: www.STCMCUDATA.com  ---------------------------------------*/
/* --- BBS: www.STCAIMCU.com  -----------------------------------------*/
/* --- QQ:  800003751 -------------------------------------------------*/
/* 如果要在程序中使用此代码,请在程序中注明使用了STC的资料及程序        */
/*---------------------------------------------------------------------*/

#include "stc.h"
#include "timer.h"

#define TM_1MS      (65536 - FOSC/1000)

BOOL f1ms;

void timer_init()
{
    f1ms = 0;
    AUXR |= 0x80;
    TMOD &= ~0x0f;
    TL0 = TM_1MS;
    TH0 = TM_1MS >> 8;
    TR0 = 1;
    ET0 = 1;
}

//void Timer1_Init(void)		//1428微秒@24.000MHz 700Hz
//{
//	AUXR |= 0x40;			//定时器时钟1T模式
//	TMOD &= 0x0F;			//设置定时器模式
//    TL1 = 0x20;				//设置定时初始值
//	TH1 = 0x7A;				//设置定时初始值
//	TF1 = 0;				//清除TF1标志
//	TR1 = 1;				//定时器1开始计时
//    ET1 = 1; 
//}


void Timer1_Init(void)		//714微秒@24.000MHz   700Hz
{
	AUXR |= 0x40;			//定时器时钟1T模式
	TMOD &= 0x0F;			//设置定时器模式
	TL1 = 0x10;				//设置定时初始值
	TH1 = 0xBD;				//设置定时初始值
	TF1 = 0;				//清除TF1标志
	TR1 = 1;				//定时器1开始计时
    ET1 = 1; 
}

void timer0_isr() interrupt 1
{
    f1ms = 1;
}
